ats = {
    0: ["甲", "子"], 1: ["乙", "丑"], 2: ["丙", "寅"], 3: ["丁", "卯"], 4: ["戊", "辰"],
    5: ["己", "巳"], 6: ["庚", "午"], 7: ["辛", "未"], 8: ["壬", "申"], 9: ["癸", "酉"]
}
ads = {
    0: ["子", "鼠"], 1: ["丑", "牛"], 2: ["寅", "虎"], 3: ["卯", "兔"], 4: ["辰", "龍"],
    5: ["巳", "蛇"], 6: ["午", "馬"], 7: ["未", "羊"], 8: ["申", "猴"], 9: ["酉", "雞"],
    10: ["戌", "狗"], 11: ["亥", "豬"]
}
aws = {
    0: ["木", "甲", "陽"], 1: ["木", "乙", "陰"], 2: ["火", "丙", "陽"], 3: ["火", "丁", "陰"],
    4: ["土", "戊", "陽"], 5: ["土", "己", "陰"], 6: ["金", "庚", "陽"], 7: ["金", "辛", "陰"],
    8: ["水", "壬", "陽"], 9: ["水", "癸", "陰"]
}
axs = {
    0: ["鼠", "子", "陽"], 1: ["牛", "丑", "陰"], 2: ["虎", "寅", "陽"], 3: ["兔", "卯", "陰"],
    4: ["龍", "辰", "陽"], 5: ["蛇", "巳", "陰"], 6: ["馬", "午", "陽"], 7: ["羊", "未", "陰"],
    8: ["猴", "申", "陽"], 9: ["雞", "酉", "陰"], 10: ["狗", "戌", "陽"], 11: ["豬", "亥", "陰"]
}
ays = {
    0: ["陽", "男"], 1: ["陰", "女"]
}

def f生肖五行年份(y):
    i年份 = y - 4
    i天干 = i年份 % 10
    i地支 = i年份 % 12
    (h天干, p天干) = ats[i天干]
    (h地支, p地支) = ads[i地支]
    (h五行, p五行, e五行) = aws[i天干 // 2]
    (h生肖, p生肖, e生肖) = axs[i地支]
    (h阴阳, p阴阳) = ays[i年份 % 2]
    return [[y, h天干 + h地支, h五行, h生肖, h阴阳], [None, p天干 + p地支, p五行, p生肖, p阴阳], [None, i年份 % 60 + 1 + "/60", e五行, e生肖, None]]

def main():
    for year in [1935, 1938, 1968, 1972, 1976, 1984, 2017]:
        print(f生肖五行年份(year))

def showYear(y):
    ns_xs = map(f生肖五行年份(y), FIELDWIDTHS)
    return '\n'.join(map(lambda x: ''.join(x), ns_xs))

FIELDWIDTHS = [[6, 10, 7, 8, 3], [6, 11, 8, 8, 4], [6, 11, 8, 8, 4]]

def JUSTIFYLEFT(n, c, s):
    return s[:n] + c*(n - len(s))